       IDENTIFICATION DIVISION.
       PROGRAM-ID. DASHBOARD-METRICS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-TOTAL-SALES      PIC 9(7)V99 VALUE 2100000.00.
       01 WS-TOTAL-PRODUCTS   PIC 9(7)    VALUE 2000000.
       01 WS-TOP-PRODUCT      PIC X(10)   VALUE "Notebook".
       01 WS-CURRENT-SALES    PIC 9(2)    VALUE 86.

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
    
       DISPLAY "TOTAL_SALES:" WS-TOTAL-SALES
       DISPLAY "TOTAL_PRODUCTS:" WS-TOTAL-PRODUCTS
       DISPLAY "TOP_PRODUCT:" WS-TOP-PRODUCT
       DISPLAY "CURRENT_PERCENT:" WS-CURRENT-SALES
       STOP RUN.